import './Navbar.css';

export default function Navbar(userInfo) {
  const { name, img, admin } = userInfo;

  return `
  <div class="navbar_logo">
            <a href="/"><img src="/public/assets/images/logo.png" alt="logo"/></a>
          </div>
          <svg class="navbar_arrow navbar_arrow_none" width="50" height="50" viewBox="0 0 50 50" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.3021 24.9999L24.375 33.1249C24.757 33.5069 24.957 33.9846 24.975 34.5583C24.9931 35.1319 24.7931 35.6263 24.375 36.0416C23.9931 36.4235 23.507 36.6145 22.9167 36.6145C22.3264 36.6145 21.8403 36.4235 21.4584 36.0416L11.875 26.4583C11.6667 26.2499 11.5188 26.0242 11.4313 25.7812C11.3438 25.5381 11.3014 25.2777 11.3042 24.9999C11.307 24.7221 11.3507 24.4617 11.4355 24.2187C11.5202 23.9756 11.6674 23.7499 11.8771 23.5416L21.4605 13.9583C21.8424 13.5763 22.3202 13.377 22.8938 13.3603C23.4674 13.3437 23.9618 13.543 24.3771 13.9583C24.7591 14.3402 24.95 14.8263 24.95 15.4166C24.95 16.0069 24.7591 16.493 24.3771 16.8749L16.3021 24.9999ZM30.0521 24.9999L38.125 33.1249C38.507 33.5069 38.707 33.9846 38.725 34.5583C38.7431 35.1319 38.5431 35.6263 38.125 36.0416C37.7431 36.4235 37.257 36.6145 36.6667 36.6145C36.0764 36.6145 35.5903 36.4235 35.2084 36.0416L25.625 26.4583C25.4167 26.2499 25.2688 26.0242 25.1813 25.7812C25.0938 25.5381 25.0514 25.2777 25.0542 24.9999C25.057 24.7221 25.1007 24.4617 25.1855 24.2187C25.2702 23.9756 25.4174 23.7499 25.6271 23.5416L35.2105 13.9583C35.5924 13.5763 36.0702 13.377 36.6438 13.3603C37.2174 13.3437 37.7118 13.543 38.1271 13.9583C38.5091 14.3402 38.7 14.8263 38.7 15.4166C38.7 16.0069 38.5091 16.493 38.1271 16.8749L30.0521 24.9999Z" fill="currentColor"/>
          </svg>
          <div class="navbar_menu">
            <ul class="navbar_list">
              <li class="navbar_item"><a href="/notice">공지사항</a></li>
              <li class="navbar_item"><a href="/vacation">휴가/외출 관리</a></li>
              ${
                admin
                  ? `<div class="navbar_line"></div>
              <li class="navbar_item"><a href="/employee">임직원 관리</a></li>`
                  : ''
              } 
            </ul>
          </div>
          <div class="navbar_profile">
            <div class="navbar_user">
              <img
              src=${img ? img : '/public/assets/images/profile-default.png'}
              class="navbar_photo"
              alt="navbarprofile"
              />
              <div class="navber_text">
                <div class="navbar_name">${name}님</div>
                ${admin ? `<div class="navbar_admin">관리자 계정</div>` : ''}
              </div>
            </div>
            <a class="navbar_logoutBtn" href="/login">
              <svg class="navbar_logoutIcon" width="40" height="40" viewBox="0 0 50 51" fill="currentColor" xmlns="http://www.w3.org/2000/svg"><path d="M5.75 40.1004L5.75 40.101C5.75155 41.3814 6.21308 42.4894 7.12145 43.3977C8.02983 44.3061 9.1373 44.7671 10.4167 44.7671H25H25.5V44.2671V40.1004V39.6004H25H10.9167V11.4338H25H25.5V10.9338V6.76709V6.26709H25L10.4167 6.26709L10.4161 6.26709C9.13813 6.26864 8.03113 6.7304 7.12175 7.63824C6.21188 8.54656 5.75 9.65411 5.75 10.9338L5.75 40.1004ZM32.9705 36.2778L33.3238 36.6504L33.6869 36.2873L44.1036 25.8706L44.4571 25.5171L44.1036 25.1635L33.6869 14.7469L33.3238 14.3838L32.9705 14.7564L30.1059 17.7772L29.7709 18.1305L30.1152 18.4748L34.5741 22.9338H18.75H18.25V23.4338V27.6004V28.1004H18.75H34.5741L30.1152 32.5594L29.7709 32.9037L30.1059 33.257L32.9705 36.2778Z" fill="currentColor" stroke="currentColor"/></svg>
            </a>
          </div>
          `;
}
